''' 
(Information About Event-driven programming):

البرمجة المدفوعة بالأحداث هي نمط برمجة يتم فيه تحديد تدفق البرنامج بواسطة الأحداث 
, أو إجراءات المستخدم بدلاً من التنفيذ التسلسلي للتعليمات
في البرمجة المدفوعة بالأحداث، يقوم البرنامج بالانتظار لحدوث الأحداث ثم يستجيب لهذه الأحداث
عن طريق تنفيذ معالجات الأحداث المحددة أو استدعاء دوال الاستجابة.

وإليك بعض المفاهيم الرئيسية وأمثلة ذات صلة بالبرمجة المدفوعة بالأحداث

•	الأحداث: الأحداث هي حوادث أو إجراءات تحدث أثناء تنفيذ البرنامج. 
يمكن أن تتم تفعيل الأحداث بواسطة تفاعلات المستخدم، 
إشعارات النظام أو مصادر أخرى. أمثلة على الأحداث تشمل نقرات الأزرار
، حركات الماوس، ضغطات المفاتيح، رسائل الشبكة أو انتهاء المؤقت.

•	معالجات الأحداث: معالجات الأحداث هي دوال أو أساليب تنفذ استجابةً 
لأحداث محددة. تحدد معالجات الأحداث السلوك أو الإجراءات التي يجب تنفيذها 
عند حدوث حدث معين. غالبًا ما تتم تسجيل أو ربط معالجات 
الأحداث بأحداث محددة بحيث يتم استدعاؤها تلقائيًا عند حدوث الحدث المقابل.

•	تطبيقات واجهة المستخدم الرسومية:
تعتبر تطبيقات واجهة المستخدم الرسومية (GUI) مثالًا شائعًا للبرمجة المدفوعة بالأحداث. 
في برمجة واجهة المستخدم، تقوم الأحداث مثل نقرات الأزرار، حركات الماوس،
أو تغييرات حجم النافذة 

•	تطوير الويب: يعتمد تطوير الويب بشكل كبير أيضًا على البرمجة المدفوعة بالأحداث.
عندما يتفاعل المستخدمون مع صفحات الويب، تقوم الأحداث مثل نقرات الأزرار

بشكل عام، توفر البرمجة المدفوعة بالأحداث طريقة مرنة
ومتجاوبة للتعامل مع تفاعلات المستخدم والأحداث في النظام. 
تسمح برامجك بأن تكون قائمة على الأحداث وتستجيب بشكل ديناميكي للتغيرات في البيئة.
'''
